Revit 2024 API
ExportPDFSettings.ListNames Method
 Returns all the names of the settings instances in the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public static IList<string> ListNames(
	Document document
)
Visual Basic
Public Shared Function ListNames ( _
	document As Document _
) As IList(Of String)
Visual C++
public:
static IList<String^>^ ListNames(
	Document^ document
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 Document where the settings to be found.
Return Value
 List of names.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExportPDFSettings Class
Autodesk.Revit.DB Namespace